#+TITLE: Notes

* Work schedule log
** Creation of database and testing sending data to backend
:LOGBOOK:
CLOCK: [2021-06-02 Wed 9:00]--[2021-06-02 Wed 17:00] =>  8:00
:END:
To alter database run sql in file alter.sql

** Setting up hook on survey to plug get data to database
:LOGBOOK:
CLOCK: [2021-06-03 Thu 09:00]--[2021-06-03 Thu 17:00] =>  8:00
:END:
If the question has #other option, instead of returning text what user wrote, it just returns you the #other keyword. ask about if we need to handle that, check for this.
  - Annelie Berner  1 hour ago
    we don’t use the value text, no


** Forming data from API to graph format
   :LOGBOOK:
   CLOCK: [2021-06-04 Fri 09:00]--[2021-06-04 Fri 15:00] =>  6:00
   :END:
   If there is need it is possible to create function which transforms empty "" into null for better performance. This can be done in quadratix survey code, but working in survey platform is painfully slow, and hard to test, error-prone.
